app/views/interviews/_form.html.erb

SELECT `applicants`.* FROM `applicants`
---
    <%= f.label :applicant %><br />
    <%= f.collection_select :applicant_id, Applicant.all, :id, :name, {:prompt => "Select Applicant"} %>

SELECT `mandates`.* FROM `mandates`
---
    <%= f.label :mandate %><br />
    <%= f.collection_select :mandate_id, Mandate.all, :id, :name, {:prompt => "Select Mandate"} %>